Задача 9

Возврат значения

Оператор return используется для передачи значения из тела функции во внешний код. Когда интерпретатор встречает return, он сразу же выходит из функции (прекращает её выполнение), и возвращает указанное значение в то место кода, где функция была вызвана.

function multiply(x, y, z) {
  console.log('Код до return выполняется как обычно');

  // Возвращаем результат выражения умножения
  return x * y * z;

  console.log('Этот лог никогда не выполнится, он стоит после return');
}

// Результат работы функции можно сохранить в переменную
let result = multiply(2, 3, 5);
console.log(result); // 30

result = multiply(4, 8, 12);
console.log(result); // 384

result = multiply(17, 6, 25);
console.log(result); // 2550
Оператор return без явно указанного значения возвращает специальное значение undefined. При отсутствии return в теле функции, она все равно вернёт undefined.

Задание

Дополни код функции add так, чтобы она возвращала результат сложения значений трёх параметров a, b и c.

Тесты

Объявлена функция add(a, b, c).
В функции add есть оператор return.
Вызов add(15, 27, 10) возвращает 52.
Вызов add(10, 20, 30) возвращает 60.
Вызов add(5, 10, 15) возвращает 30.
Вызов функции со случайными, но валидными аргументами, возвращает правильное значение.


function add(a, b, c) {
  //  Пиши код ниже этой строки
  return (a + b + c);
  
  
//  Пиши код выше этой строки
}

add(2, 5, 8); // 15

console.log(add(15, 27, 10));
console.log(add(10, 20, 30));
console.log(add(5, 10, 15));

Задача 10

Шаблонные строки 2.0

Задание

Функция makeMessage(name, price) составляет и возвращает сообщение о покупке. Она объявляет два параметра, значения которых будут задаваться во время её вызова.

name - название товара
price - цена товара
Дополни код функции так, чтобы в переменную message записывалась строка Вы выбрали <имя товара>, цена за штуку <цена товара> кредитов, где <имя товара> и <цена товара> это значения параметров name и price. Используй синтаксис шаблонных строк.

Внимание
Обрати внимание на то, что в коде нет вызовов функции makeMessage. С этого задания и дальше мы сами будем вызывать твои функции и проверять то, как они работают. Результат наших проверок ты увидишь в блоке Результаты под редактором кода.

Тесты

Объявлена функция makeMessage(name, price).
Вызов makeMessage('Радар', 6150) возвращает 'Вы выбрали Радар, цена за штуку 6150 кредитов'.
Вызов makeMessage('Сканер', 3500) возвращает 'Вы выбрали Сканер, цена за штуку 3500 кредитов'.
Вызов makeMessage('Реактор', 8000) возвращает 'Вы выбрали Реактор, цена за штуку 8000 кредитов'.
Вызов makeMessage('Двигатель', 4070) возвращает 'Вы выбрали Двигатель, цена за штуку 4070 кредитов'.



function makeMessage (name, price) {
  // Пиши код ниже этой строки
   const message = `Вы выбрали ${name}, цена за штуку ${price} кредитов`;
  // Пиши код выше этой строки
  return message;
};

Задача 11

Математические операторы 2.0

Задание

Функция calculateTotalPrice считает и возвращает общую сумму покупки. Она принимает два параметра, значения которых будут задаваться во время её вызова.

orderedQuantity - количество единиц товара в заказе;
pricePerItem - цена одной единицы товара.
Дополни код функции так, чтобы в переменную totalPrice записывалась общая сумма покупки, результат умножения кол-ва товаров на цену одного.

Тесты

Объявлена функция calculateTotalPrice (orderedQuantity, pricePerItem).
Вызов calculateTotalPrice(5, 100) возвращает 500.
Вызов calculateTotalPrice(8, 60) возвращает 480.
Вызов calculateTotalPrice('3, 400) возвращает 1200.
Вызов calculateTotalPrice(1, 3500) возвращает 3500.
Вызов calculateTotalPrice(12, 70) возвращает 840.
Вызов функции со случайными, но валидными аргументами, возвращает правильное значение.



function calculateTotalPrice (orderedQuantity, pricePerItem) {
  // Пиши код ниже этой строки
  const totalPrice = orderedQuantity * pricePerItem;

  // Пиши код выше этой строки
  return totalPrice;
};

Задача 12

Заказ продукта 2.0

Задание

Функция makeOrderMessage(orderedQuantity, pricePerDroid, deliveryFee) составляет и возвращает сообщение о покупке ремонтных дроидов. Она объявляет три параметра, значения которых будут задаваться во время её вызова.

orderedQuantity - количество дроидов в заказе
pricePerDroid - цена одного дроида
deliveryFee - стоимость доставки
Дополни код функции так, чтобы она возвращала сообщение о заказе в формате Вы заказали дроидов на сумму <сумма заказа> кредитов. Доставка (<цена доставки> кредитов) включена в сумму заказа.. Не забудь о цене доставки при вычислениях общей стоимости.

Тесты

Объявлена функция makeOrderMessage(orderedQuantity, pricePerDroid, deliveryFee).
Вызов makeOrderMessage(2, 100, 50) возвращает 'Вы заказали дроидов на сумму 250 кредитов. Доставка (50 кредитов) включена в сумму заказа.'.
Вызов makeOrderMessage(4, 300, 100) возвращает 'Вы заказали дроидов на сумму 1300 кредитов. Доставка (100 кредитов) включена в сумму заказа.'.
Вызов makeOrderMessage(10, 70, 200) возвращает 'Вы заказали дроидов на сумму 900 кредитов. Доставка (200 кредитов) включена в сумму заказа.'.

function makeOrderMessage(orderedQuantity, pricePerDroid, deliveryFee) {
  // Пиши код ниже этой строки
const makeOrderMessage = orderedQuantity * pricePerDroid + deliveryFee;
  const message = `Вы заказали дроидов на сумму ${makeOrderMessage} кредитов. Доставка (${deliveryFee} кредитов) включена в сумму заказа.`;

  // Пиши код выше этой строки
  return message;
}

Задача 13

Операторы сравнения >, >=, < и <=

Используются для сравнения двух значений. Результатом своего выполнения возвращают буль - true или false, то есть «да» или «нет».

> - больше
< - меньше
>= - больше или равно
<= - меньше или равно
const a = 2;
const b = 5;

console.log(a > b); // false
console.log(b > a); // true
console.log(a >= b); // false
console.log(b >= a); // true

console.log(a < b); // true
console.log(b < a); // false
console.log(a <= b); // true
console.log(b <= a); // false
Функция isAdult объявляет один параметр age (возраст), значение которого будет задаваться во время её вызова.

Задание

Функция isAdult объявляет один параметр age (возраст), значение которого будет задаваться во время её вызова. Присвой переменной passed выражение проверки возраста пользователя на совершеннолетие. Человек считается совершеннолетним в возрасте 18 лет и старше.

Тесты

Объявлена функция isAdult(age).
В выражении проверки используется оператор >=.
Вызов isAdult(20) возвращает true.
Вызов isAdult(14) возвращает false.
Вызов isAdult(8) возвращает false.
Вызов isAdult(37) возвращает true.



function isAdult(age) {
  // Пиши код ниже этой строки
  const passed = age >= 18;

  // Пиши код выше этой строки
  return passed;
}

Задача 14

Операторы сравнения === и !==

«Нестрогие» операторы == и != выполняют преобразование типов сравниваемых значений, что может привести к ошибкам, особенно у начинающих.

// ❌ Плохо, выполняется приведение типов

console.log(5 == '5'); // true
console.log(5 != '5'); // false
console.log(1 == true); // true
console.log(1 != true); // false

Поэтому для проверки равенства или неравенства двух значений используются операторы === (строгое равенство) и !== (строгое неравенство), которые не выполняют приведение типов операндов.

// ✅ Хорошо, приведение типов не выполняется

console.log(5 === '5'); // false
console.log(5 === 5); // true
console.log(5 !== '5'); // true
console.log(5 !== 5); // false
console.log(1 === true); // false
console.log(1 !== true); // true

Задание

Функция `isValidPassword(password)` проверяет равенство сохранённого и введённого паролей и возвращает результат проверки - буль `true` или `false`. Переменная `SAVED_PASSWORD` хранит значение ранее сохраненного пароля. Введённый пароль передаётся в параметр `password`.
Присвой переменной isMatch выражение проверки равенства введённого и сохранённого ранее паролей. Результатом выражения проверки должно быть true, если значения совпадают, и false, если нет.

Тесты

Объявлена функция isValidPassword(password).
В выражении проверки паролей использован оператор ===.
Вызов isValidPassword('mangodab3st') возвращает false.
Вызов isValidPassword('kiwirul3z') возвращает false.
Вызов isValidPassword('jqueryismyjam') возвращает true.


function isValidPassword(password) {
  const SAVED_PASSWORD = 'jqueryismyjam';
  // Пиши код ниже этой строки
  const isMatch = password === SAVED_PASSWORD;

  // Пиши код выше этой строки
  return isMatch;
}

Задача 15


Инструкция if...else

Ветвления используются для выполнения различного кода в зависимсти от условия. Принцип работы простой - результат выражения в условии блока if приводится к булю true или false.

if (условие) {
  // тело if
} else {
  // тело else
}
Если условие приводится к true, то выполняется код в фигурных скобках тела if, а блок else игнорируется.

let cost;
const subscription = 'pro';

if (subscription === 'pro') {
  cost = 100;
} else {
  cost = 0;
}

console.log(cost); // 100
Если условие приводится к false, код блока if будет пропущен, и выполнится код в фигурных скобках после блока else.

let cost;
const subscription = 'free';

if (subscription === 'pro') {
  cost = 100;
} else {
  cost = 0;
}

console.log(cost); // 0

Задание

Добавь выражение проверки совершеннолетия пользователя, значения параметра age, в условие для инструкции if.

Если пользователь совершеннолетний, должен выполняться блок if и в переменную message записывается строка 'Вы совершеннолетний человек'.
В противном случае должен выполняться блок else и записывается строка 'Вы не совершеннолетний человек'.

Тесты

Объявлена функция checkAge(age).
В выражении проверки возраста использован оператор >=.
Вызов checkAge(20) возвращает 'Вы совершеннолетний человек'.
Вызов checkAge(8) возвращает 'Вы не совершеннолетний человек'.
Вызов checkAge(14) возвращает 'Вы не совершеннолетний человек'.
Вызов checkAge(38) возвращает 'Вы совершеннолетний человек'.


function checkAge(age) {
  let message;

  if (age >= 18) { // Дополни эту строку
    message = 'Вы совершеннолетний человек';
  } else {
    message = 'Вы не совершеннолетний человек';
  }

  return message;
}


Задача 16

Задача: склад товаров

Задание

Функция checkStorage(available, ordered) проверяет возможность оформления заказа и возвращает сообщение о результате. Она объявляет два параметра, значения которых будут задаваться во время её вызова:

available - общее количество товаров на складе
ordered - единиц товара в заказе
Используя ветвления дополни код функции так, что:

Если в заказе указано число, превышающее количество товаров на складе, в переменную message записывается строка 'На складе недостаточно товаров!'.
В противном случае записывается строка 'Заказ оформлен, с вами свяжется менеджер'.

Тесты

Объявлена функция checkStorage(available, ordered).
Вызов checkStorage(100, 50) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(100, 130) возвращает 'На складе недостаточно товаров!'.
Вызов checkStorage(200, 20) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(200, 150) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(150, 180) возвращает 'На складе недостаточно товаров!'.


function checkStorage(available, ordered) {
  let message;
  // Пиши код ниже этой строки

  if (ordered >= available) {
    message = 'На складе недостаточно товаров!';
  } else {
    message = 'Заказ оформлен, с вами свяжется менеджер';}
  // Пиши код выше этой строки
  return message;
}

Задача 17

Оператор присвоения с добавлением/вычитанием/умножением/делением

Комбинированные операторы это более краткий способ присвоить перменной новое значение основываясь на её предыдущем значении.

Будем увеличивать значение переменной age на единицу от предыдущего, имитируя обновление возраста после дня рождения пользователя.

let age = 25;
// Классическая запись
age = age + 1;
console.log(age); // 26
Сначала выполняется правая часть выражения. Вместо age подставляется 25, выполняется операция сложения и в перменную age записывается 26.

Выполним рефакторинг операции обновления возраста, используя комбинированный оператор присвоения с добавлением.

let age = 25;
// Просто более краткая запись, работает также
age += 1;
console.log(age); // 26

Задание

Замени выражения со стандартными математеческими операторами на комбинированный оператор присвоения с добавлением, вычитанием, умножением и делением.

Тесты

Значение переменной a равно 7.
Использован оператор +=.
Значение переменной b равно 6.
Использован оператор -=.
Значение переменной c равно 45.
Использован оператор *=.
Значение переменной d равно 2.
Использован оператор /=.


let a = 5;
let b = 10;
let c = 15;
let d = 20;

// Пиши код ниже этой строки
a += 2;
b -= 4;
c *= 3;
d /= 10;

Задача 18

Проверка баланса

Задание

Станция по продаже ремонтных дроидов готова к запуску, осталось написать программное обеспечение для отдела продаж.

Функция makeTransaction(pricePerDroid, orderedQuantity, customerCredits) выполняет транзакцию по продаже дроидов и возвращает сообщение о результате операции. Она объявляет три параметра, значения которых будут задаваться во время её вызова:

pricePerDroid - цена одного дроида;
orderedQuantity - кол-во заказанных дроидов;
customerCredits - сумма средств на счету клиента.
Дополни её следующим функционалом:

Объяви переменную totalPrice для хранения общей суммы заказа и присвой ей выражение расчёта этой суммы.
Добавь проверку сможет ли клиент оплатить заказ:
если сумма к оплате превышает количество кредитов на счету клиента, запиши в переменную message строку 'Недостаточно средств на счету!';
в противном случае, вычти сумму покупки со счёта клиента и запиши в переменную message сообщение: 'Вы купили <число> дроидов, на счету осталось <число> кредитов'.

Тесты

Объявлена функция makeTransaction(pricePerDroid, orderedQuantity, customerCredits).
Вызов makeTransaction(3000, 5, 23000) возвращает 'Вы купили 5 дроидов, на счету осталось 8000 кредитов'.
Вызов makeTransaction(1000, 3, 15000) возвращает 'Вы купили 3 дроидов, на счету осталось 12000 кредитов'.
Вызов makeTransaction(5000, 10, 8000) возвращает 'Недостаточно средств на счету!'.
Вызов makeTransaction(2000, 8, 10000) возвращает 'Недостаточно средств на счету!'.
Вызов makeTransaction(500, 10, 5000) возвращает 'Вы купили 10 дроидов, на счету осталось 0 кредитов'.

function makeTransaction(pricePerDroid, orderedQuantity, customerCredits) {
  let message;
  // Пиши код ниже этой строки
  let totalPrice = pricePerDroid * orderedQuantity;
  if (totalPrice > customerCredits) {
    message = 'Недостаточно средств на счету!';}
 else {customerCredits = customerCredits - totalPrice;
    message = `Вы купили ${orderedQuantity} дроидов, на счету осталось ${customerCredits} кредитов`;}

  // Пиши код выше этой строки
  return message;
}

Задача 19

Блок else...if

Конструкция if...else может проверить и среагировать на выполнение или невыполнение только одного условия.

let cost;
const subscription = 'pro';

if (subscription === 'pro') {
  cost = 100;
} else {
  cost = 0;
}

console.log(cost); // 100
Блок else...if позволяет добавить после else еще один оператор if с условием. В конце цепочки может быть классический блок else, который выполнится только в случае, когда ни одно из условий не приведётся к true.

let cost;
const subscription = 'premium';

if (subscription === 'free') {
  cost = 0;
} else if (subscription === 'pro') {
  cost = 100;
} else if (subscription === 'premium') {
  cost = 500;
} else {
  console.log(`Невалидный тип подписки ${subscription}`);
}

console.log(cost); // 500
При первом же удовлетворяющем условии проверки прекратятся и выполнится только тело соответствующего блока if. Поэтому подобную запись следует читать как: «ищу первое выполнение условия, игнорирую всё остальное».

Задание

Функция checkPassword(password) получает пароль пользователя в параметр password, проверяет его на совпадение с паролем администратора в переменной ADMIN_PASSWORD и возвращает сообщение о результате сравнения, хранящееся в переменной message.

Если значение параметра password равно null, значит пользователь отменил операцию и в message записывается строка 'Отменено пользователем!'.
Если значение параметра password совпадает со значением ADMIN_PASSWORD, в переменную message присваивается строка 'Добро пожаловать!'.
Если ни одно из предыдущих условий не выполнилось, в переменную message записывается строка 'Доступ запрещен, неверный пароль!'.

Тесты

Объявлена функция checkPassword(password).
Вызов checkPassword('mangohackzor') возвращает 'Доступ запрещен, неверный пароль!'.
Вызов checkPassword(null) возвращает 'Отменено пользователем!'.
Вызов checkPassword('polyhax') возвращает 'Доступ запрещен, неверный пароль!'.
Вызов checkPassword('jqueryismyjam') возвращает 'Добро пожаловать!'.


function checkPassword(password) {
  const ADMIN_PASSWORD = 'jqueryismyjam';
  let message;

  if (password === null) { // Дополни эту строку
    message =  'Отменено пользователем!';
  } else if (password === ADMIN_PASSWORD) { // Дополни эту строку
    message = 'Добро пожаловать!';
  } else {
    message = 'Доступ запрещен, неверный пароль!';
  }

  return message;
}


Задача 20

Задача: склад товаров 2.0

Задание

Функция checkStorage(available, ordered) проверяет возможность оформления заказа и возвращает сообщение о результате. Она объявляет два параметра, значения которых будут задаваться во время её вызова.

available - доступное количество товаров на складе
ordered - единиц товара в заказе
Используя ветвления дополни код функции так, что:

Если в заказе еще нет товаров, то есть значение параметра ordered равно 0, в переменную message присваивается строка В заказе еще нет товаров.
Eсли товаров в заказе больше чем доступно товаров на складе, то в переменную message присваивается строка 'Слишком большой заказ, на складе недостаточно товаров!'.
В противном случае в переменную message присваевается строка 'Заказ оформлен, с вами свяжется менеджер'.

Тесты

Объявлена функция checkStorage(available, ordered).
Вызов checkStorage(100, 50) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(100, 130) возвращает 'Слишком большой заказ, на складе недостаточно товаров!'.
Вызов checkStorage(70, 0)возвращает 'В заказе еще нет товаров'.
Вызов checkStorage(200, 20) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(200, 250) возвращает 'Слишком большой заказ, на складе недостаточно товаров!'.
Вызов checkStorage(150, 0) возвращает 'В заказе еще нет товаров'.


function checkStorage(available, ordered) {
  let message;
  // Пиши код ниже этой строки
  
  if (ordered === 0) {
    message = 'В заказе еще нет товаров';
  } else if (ordered > available) {
    message = 'Слишком большой заказ, на складе недостаточно товаров!';
  } else {
    message = 'Заказ оформлен, с вами свяжется менеджер';}
  // Пиши код выше этой строки
  return message;
}

Задача 21

Логическое «И» (оператор &&)

Логические операторы используются для проверки условий с множественными выражениями, например в ветвлениях.

Оператор && приводит все операнды к булю и возвращает значение одного из них. Левый операнд, если его можно привести к false, и правый в остальных случаях.

выражение && выражение
В следующем примере оба условия вернут true, поэтому результатом всего выражения будет true - вернётся значение правого операнда.

const age = 20;
console.log(age > 10 && age < 30); // true && true -> true
Если хотя бы один из операндов будет приведён к false, результатом выражения будет этот операнд.

const age = 50;
console.log(age > 10 && age < 30); // true && false -> false
console.log(age > 80 && age < 120); // false && true -> false
То есть логическое «И» запинается на лжи и возвращает то, на чём запнулось или последний операнд.

console.log(true && false); // false
console.log(false && true); // false
console.log(true && true); // true

console.log(3 && false); // false
console.log(false && 3); // false
console.log(3 && true); // true
console.log(true && 3); // 3

Полезно

Запомните шесть значений, которые в булевом преобразовании приводятся к `false`: `0`, `NaN`, `null`, `undefined`, пустая строка `""` или `''` и само значение `false`. Абсолютно всё остальное приводится к `true`.

console.log(1 && 5); // true && true -> 5
console.log(5 && 1); // true && true -> 1
console.log(0 && 2); // false && true -> 0
console.log(2 && 0); // true && false -> 0
console.log('' && 'Манго'); // false && true -> ''
console.log('Манго' && ''); // true && false -> ''
console.log('Манго' && 'Поли'); // true && true -> 'Поли'
console.log('Поли' && 'Манго'); // true && true -> 'Манго'

Задание

Функция isNumberInRange(start, end, number) проверяет, входит ли число в промежуток. Она объявляет три параметра, значения которых будут задаваться во время её вызова:

number - число, вхождение которого проверяется
start - начало числового промежутка
end - конец числового промежутка
Присвой переменной isInRange выражение проверки вхождения number в числовой промеждуток от srart до end. То есть число должно быть больше либо равно start и меньше либо равно end. Результатом выражения проверки будет буль true или false.

Тесты

Объявлена функция isNumberInRange(start, end, number).
В выражении проверки использован оператор &&.
Вызов isNumberInRange(10, 30, 17) возвращает true.
Вызов isNumberInRange(10, 30, 5) возвращает false.
Вызов isNumberInRange(20, 50, 24) возвращает true.
Вызов isNumberInRange(20, 50, 76) возвращает false.


function isNumberInRange(start, end, number) {
  const isInRange = number >= start && number <= end; // дополни эту строку

  return isInRange;
}

Задача 22

Логическое «ИЛИ» (оператор ||)

Оператор || приводит все операнды к булю и возвращает значение одного из них. Левый операнд, если его можно привести к true, и правый в остальных случаях.

выражение || выражение
В следующем примере условие слева вернёт true, поэтому результатом всего выражения будет true - вернётся значение первого операнда, которое было приведено к true.

const age = 5;
console.log(age < 10 || age > 30); // true || false -> true
Тут результатом тоже будет true, так как хотя бы один из операндов, в этом случае правый, был приведён к true.

const age = 40;
console.log(age < 10 || age > 30); // false || true -> true
А здесь ни одно из условий не выполняется, поэтому получаем false - значение последнего операнда.

const age = 20;
console.log(age < 10 || age > 30); // false || false -> false
То есть логическое «ИЛИ» запинается на правде и возвращает то, на чём запнулось или последний операнд.

console.log(true || false); // true
console.log(false || true); // true
console.log(true || true); // true

console.log(3 || false); // 3
console.log(false || 3); // 3
console.log(3 || true); // 3
console.log(true || 3); // true

Задание

Функция checkIfCanAccessContent(subType) проверяет, может ли пользователь получить доступ к контенту. Проверка происходит по типу подписки. Получить доступ могут только пользователи с подпиской pro или vip.

Присвой переменной canAccessContent выражение проверки подписки. Если значение параметра subType равно строкам 'pro' или 'vip', пользователь получит доступ. Результатом выражения проверки будет буль true или false.

Тесты

Объявлена функция checkIfCanAccessContent(subType).
В выражении проверки использован оператор ||.
Вызов checkIfCanAccessContent('pro') возвращает true.
Вызов checkIfCanAccessContent('starter') возвращает false.
Вызов checkIfCanAccessContent('vip') возвращает true.
Вызов checkIfCanAccessContent('free') возвращает false.


 function checkIfCanAccessContent(subType) {
  const canAccessContent = subType === 'pro'  || subType === 'vip'; // дополни эту строку

  return canAccessContent;
}

Задача 23

Логическое «НЕ» (оператор !)

Все операторы, которые мы рассматривали до этого, были бинарными. Т.е. они содержали два операнда: левый и правый. Логическое «НЕ» - это унарный оператор, выполняющий операцию над одним операндом справа.

!выражение
Оператор ! приводит операнд к булю, если необходимо, а затем делает инверсию - заменяет его на противоположный true -> false или false -> true.

console.log(!true); // false
console.log(!false); // true
console.log(!3); // !3 -> !true -> false
console.log(!'Манго'); // !'Манго' -> !true -> false
console.log(!0); // !0 -> !false -> true
console.log(!''); // !'' -> !false -> true

const isOnline = true;
const isNotOnline = !isOnline; // !isOnline -> !true -> false

Задание

Функция isNumberNotInRange(start, end, number) проверяет, не входит ли число в промежуток. То есть число должно быть меньше либо равно start и больше либо равно end. Результатом выражения проверки будет буль true или false.

Она объявляет три параметра, значения которых будут задаваться во время её вызова:

number - число, не вхождение которого проверяется
start - начало числового промежутка
end - конец числового промежутка
Присвой переменной isNotInRange выражение инверсии значения переменной isInRange используя оператор !.

Тесты

Объявлена функция isNumberNotInRange(start, end, number).
В выражении использован оператор !.
Вызов isNumberNotInRange(10, 30, 17) возвращает false.
Вызов isNumberNotInRange(10, 30, 5) возвращает true.
Вызов isNumberNotInRange(20, 50, 24) возвращает false.
Вызов isNumberNotInRange(20, 50, 76) возвращает true.


function isNumberNotInRange(start, end, number) {
  const isInRange = number >= start && number <= end;
  const isNotInRange = !isInRange; // Дополни эту строку

  return isNotInRange;
}

Задача 24

Задача: расчёт скидки

Задание

Функция getDiscount(totalSpent) определяет значение скидки в зависимости от общей суммы потраченных денег (параметр totalSpent) в магазине за всё время (партнёрская программа). Скидка записывается в переменную discount и возвращается из функции как результат её работы.

Используя ветвления и логические операторы, дополни код функции.

Если потрачено от 50000 или больше кредитов - скидка 10% (золотой партнёр)
Если потрачено от 20000 (включительно) до 50000 кредитов - скидка 5% (серебрянный партнёр)
Если потрачено от 5000 (включительно) до 20000 кредитов - скидка 2% (бронзовый партнёр)
Если потрачено меньше чем 5000 кредитов - скидка 0 (базовый партнёр)
Значения скидок каждого уровня хранятся в одноимённых константах BASE_DISCOUNT, BRONZE_DISCOUNT, SILVER_DISCOUNT и GOLD_DISCOUNT.

Тесты

Объявлена функция getDiscount(totalSpent).
Вызов getDiscount(137000) возвращает 0.1.
Вызов getDiscount(46900) возвращает 0.05.
Вызов getDiscount(8250) возвращает 0.02.
Вызов getDiscount(1300) возвращает 0.
Вызов getDiscount(5000) возвращает 0.02.
Вызов getDiscount(20000) возвращает 0.05.
Вызов getDiscount(50000) возвращает 0.1.


function getDiscount(totalSpent) {
  const BASE_DISCOUNT = 0;
  const BRONZE_DISCOUNT = 0.02;
  const SILVER_DISCOUNT = 0.05;
  const GOLD_DISCOUNT = 0.1;
  let discount;
  // Пиши код ниже этой строки
  
  if (totalSpent >= 50000) {
    discount = GOLD_DISCOUNT;
  } else if (20000 <= totalSpent && totalSpent < 50000) {
    discount = SILVER_DISCOUNT;
  } else if (5000 <= totalSpent && totalSpent < 20000) {
    discount = BRONZE_DISCOUNT;
  } else if (totalSpent < 5000) {
    discount = BASE_DISCOUNT;
  }
  
  // Пиши код выше этой строки
  return discount;
}

Задача 25

Тернарный оператор

Тернарный оператор используется как более синтаксически краткая замена инструкции if...else, когда одной и той же переменной необходимо присвоить разные значения по условию.

<условие> ? <выражение если условие истинно> : <выражение если условие ложно>
Работает по такой схеме:

Вычисляется условие.
Если условие истинно, то есть приводится к true, вычисляется выражение после ?.
Если условие ложно, то есть приводится к false, вычисляется выражение после :.
Значение вычисленного выражения возвращается как результат работы тернарного оператора.
let type;
const age = 20;

if (age >= 18) {
  type = 'adult';
} else {
  type = 'child';
}

console.log(type); // 'adult'
Выполним рефакторинг, заменив if...else тернарным оператором.

const age = 20;
const type = age >= 18 ? 'adult' : 'child';
console.log(type); // 'adult'
Внимание
Тернарный оператор должен использоваться в простых операциях присваивания или возврата. Применять его для замены сложных ветвлений — плохая практика (антипаттерн).

Задание

Выполни рефакторинг решения задачи «Склад товаров», заменив инструкцию if...else тернарным оператором.

Тесты

Объявлена функция checkStorage(available, ordered).
Использован тернарный оператор.
Вызов checkStorage(100, 50) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(100, 130) возвращает 'На складе недостаточно товаров!'.
Вызов checkStorage(200, 20) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(200, 150) возвращает 'Заказ оформлен, с вами свяжется менеджер'.
Вызов checkStorage(150, 180) возвращает 'На складе недостаточно товаров!'.


function checkStorage(available, ordered) {
  let message;
  // Пиши код ниже этой строки
  
  message = ordered > available? 'На складе недостаточно товаров!': 'Заказ оформлен, с вами свяжется менеджер';

  //if (ordered > available) {
   // message = 'На складе недостаточно товаров!';
  //} else {
    ////message = 'Заказ оформлен, с вами свяжется менеджер';
  //}

  // Пиши код выше этой строки
  return message;
}

Задача 26

Задача: проверка пароля

Задание

Функция checkPassword(password) сравнивает переданный ей пароль (параметр password) с сохранённым паролем администратора (константа ADMIN_PASSWORD) и возвращает строку с сообщением о результате.

Используя тернарный оператор дополни функцию так, что:

Если значения password и ADMIN_PASSWORD совпадают, присвой переменной message строку 'Доступ разрешен'.
В противном случае, присвой message строку 'Доступ запрещён, неверный пароль!'.

Тесты

Объявлена функция checkPassword(password).
Использован тернарный оператор.
Вызов checkPassword('jqueryismyjam') возвращает 'Доступ разрешен'.
Вызов checkPassword('angul4r1sl1f3') возвращает 'Доступ запрещён, неверный пароль!'.
Вызов checkPassword('r3actsux') возвращает 'Доступ запрещён, неверный пароль!'.


function checkPassword(password) {
  const ADMIN_PASSWORD = 'jqueryismyjam';
  let message;
  // Пиши код ниже этой строки
  message = password === ADMIN_PASSWORD? 'Доступ разрешен' : 'Доступ запрещён, неверный пароль!';
  // Пиши код выше этой строки
  return message;
}

Задача 27

Инструкция switch

В некоторых случаях неудобство чтения сложных ветвлений if...else можно избежать, используя более «плоский» синтаксис инструкции ветвления switch.

Область применения switch ограничена задачами с одним общим вопросом (что сравнивать) и множеством вариантов ответов (с чем сравнивать).

switch (значение) {
  case значение:
    инструкции;
    break;

  case значение:
    инструкции;
    break;
}
Его синтаксис состоит из блока switch(значение) - что нужно сравнить и множества отдельных случаев case значение - с чем нужно сравнить. Для сравнения используется оператор строгого равенства ===. То есть нельзя сравнить на больше или меньше, только на равенство.

Значение в блоке switch(значение) - строка или число, которое сравнивается на строгое равенство со всеми значениями в блоках case значение по порядку, сверху вниз.

Оператор break в завершении каждого блока case необходим, чтобы прервать дальнейшие проверки и сразу перейти к коду за switch в том случае, когда проверка на равенство вернула true.

Задание

Функция getSubscriptionPrice(type) получает строку с типом подписки пользователя (параметр type), проверяет её на совпадение с тремя возможными типами ежемесячной подписки и возвращает цену хранящуюся в переменной price.

Если значение параметра type это строка:

'starter' - цена подписки 0 кредитов.
'professional' - цена подписки 20 кредитов.
'organization' - цена подписки 50 кредитов.
Изначально в теле функции была инструкция if...else, которая выглядела вот так.

if (type === 'starter') {
  price = 0;
} else if (type === 'professional') {
  price = 20;
} else if (type === 'organization') {
  price = 50;
}
После рефакторинга инструкция if..else была заменена на switch. Дополни код инструкции switch, чтобы функция работала правильно.

Тесты

Объявлена функция getSubscriptionPrice(type).
Вызов getSubscriptionPrice('professional') возвращает число 20.
Вызов getSubscriptionPrice('organization') возвращает число 50.
Вызов getSubscriptionPrice('starter') возвращает число 0.


function getSubscriptionPrice(type) {
  let price;
  // Пиши код ниже этой строки

 switch (type) { // Дополни эту строку
   case 'starter':// Дополни эту строку
      price = 0; // Дополни эту строку
      break;

    case 'professional': // Дополни эту строку
      price = 20; // Дополни эту строку
      break;

    case 'organization': // Дополни эту строку
      price = 50; // Дополни эту строку
      break;
  }

  // Пиши код выше этой строки
  return price;
}

Задача 28

Инструкция switch c блоком default

Если ни одного совпадения значений не произошло, необходимо выполнить код по умолчанию, как в блоке else для инструкции if...else. Для этого после всех блоков case добавляется блок default.

switch (значение) {
  case значение:
    инструкции;
    break;

  case значение:
    инструкции;
    break;

  default:
    инструкции;
}
Оператор break после блока default не нужен, так как это и так последнее что будет выполнено в switch и управление будет передано коду за ним.

Задание

Функция checkPassword(password) получает пароль в параметр password, проверяет его на совпадение с паролем администратора в переменной ADMIN_PASSWORD и возвращает сообщение о результате сравнения, хранящееся в переменной message.

Если значение параметра password:

равно null, значит пользователь отменил операцию и в message записывается строка 'Отменено пользователем!'.
совпадает со значением ADMIN_PASSWORD, в переменную message присваивается строка 'Добро пожаловать!'.
не удобвлетворяет ни одному из предыдущих условий, в переменную message записывается строка 'Доступ запрещен, неверный пароль!'.
Проведи рефакторинг кода, заменив инструкцию if..else на switch, и не забудь о блоке default (аналог else).

Тесты

Объявлена функция checkPassword(password).
Вызов checkPassword('mangohackzor') возвращает 'Доступ запрещен, неверный пароль!'.
Вызов checkPassword(null) возвращает 'Отменено пользователем!'.
Вызов checkPassword('polyhax') возвращает 'Доступ запрещен, неверный пароль!'.
Вызов checkPassword('jqueryismyjam') возвращает 'Добро пожаловать!'.


function checkPassword(password) {
  const ADMIN_PASSWORD = 'jqueryismyjam';
  let message;

  //if (password === null) {
    //message = 'Отменено пользователем!';
//} else if (password === ADMIN_PASSWORD) {
    //message = 'Добро пожаловать!';
  //} else {
//message = 'Доступ запрещён, неверный пароль!';
  //}
  
  switch (password) {
    case null:
      message = 'Отменено пользователем!';
      break;
      
    case ADMIN_PASSWORD:
      message = 'Добро пожаловать!';
      break;
      
    default:
      message = 'Доступ запрещён, неверный пароль!';}

  return message;
}

Задача 29

Задача: доставка товара

Задание

Функция getShippingCost(country) должна проверять возможность доставки товара в страну пользователя (параметр country) и возвращать сообщение о результате хранящееся в переменной message. Обязательно используй инструкцию switch.

Формат возвращаемой строки Доставка в <страна> будет стоить <цена> кредитов, где вместо <страна> и <цена> необходимо подставить соотвествующие значения.

Список стран и стоимость доставки:

Китай - 100 кредитов
Чили - 250 кредитов
Австралия - 170 кредитов
Ямайка - 120 кредитов
Из списка видно, что доставка есть не везде. Если указанной страны нет в списке, то функция должна вернуть строку 'Извините, в вашу страну доставки нет'

Тесты

Объявлена функция getShippingCost(country).
В теле функции использована инструкция switch.
Вызов getShippingCost('Австралия') возвращает 'Доставка в Австралия будет стоить 170 кредитов'.
Вызов getShippingCost('Германия') возвращает 'Извините, в вашу страну доставки нет'.
Вызов getShippingCost('Китай') возвращает 'Доставка в Китай будет стоить 100 кредитов'.
Вызов getShippingCost('Чили') возвращает 'Доставка в Чили будет стоить 250 кредитов'.
Вызов getShippingCost('Ямайка') возвращает 'Доставка в Ямайка будет стоить 120 кредитов'.
Вызов getShippingCost('Швеция') возвращает 'Извините, в вашу страну доставки нет'.


function getShippingCost(country) {
  let message;
  // Пиши код ниже этой строки
  
  switch (country) {
    case 'Китай':
      message = 'Доставка в Китай будет стоить 100 кредитов';
      break;
      
    case 'Чили':
      message = 'Доставка в Чили будет стоить 250 кредитов';
      break;
      
      case 'Австралия':
      message = 'Доставка в Австралия будет стоить 170 кредитов';
      break;
      
      case 'Ямайка':
      message = 'Доставка в Ямайка будет стоить 120 кредитов';
      break;
      
    default:
      message = 'Извините, в вашу страну доставки нет';}
      

  // Пиши код выше этой строки
  return message;
}

Задача 30

Длина строки

Для того чтобы узнать длину строки, то есть количество её символов, у всех строк есть встроенное свойство length, значение которого можно получить обратившить к нему через точку после имени переменной или строкового литерала.

const productName = 'Ремонтный дроид';

// Если в переменной хранится строка
console.log(productName.length); // 15

// Если строковый литерал
console.log('Ремонтный дроид'.length); // 15
Задание
Функция getNameLength(name) принимает имя (параметр name) и возвращает строку, в которой указана его длина. Дополни шаблонную строку в переменной message длиной строки из параметра name.

Тесты

Объявлена функция getNameLength(name).
Вызов функции getNameLength('Poly') возвращает 'Длина вашего имени 4 символа(ов)'.
Вызов функции getNameLength('Harambe') возвращает 'Длина вашего имени 6 символа(ов)'.
Вызов функции getNameLength('Billy') возвращает 'Длина вашего имени 5 символа(ов)'.
Вызов функции getNameLength('Joe') возвращает 'Длина вашего имени 3 символа(ов)'.



function getNameLength(name) {
  const message = `Длина вашего имени ${name.length} символа(ов)`; // Дополни эту строку

  return message;
}


Задача 31

Индексация элементов строки

Строка — это индексированный набор из нуля или более символов, заключенных в одинарные, двойные или косые кавычки.

Индексация элементов строки начинается с нуля. Например, в строке 'JavaScript' буква 'J' стоит на позиции с индексом 0, а 't' идёт под индексом 9. При этом длина строки 'JavaScript' равна 10, то есть индекс последнего элемента всегда на единицу меньше чем её длина.

Для доступа к значению элемента строки используется синтаксис квадратных скобок строка[индекс].

const productName = 'Ремонтный дроид';
console.log(prodctuName[0]); // 'P'
console.log(productName[5]); // 'т'
console.log(productName[14]); // 'д'
console.log(productName[productName.length - 1]); // 'д'
Содержимое строки нельзя изменить, только прочитать. То есть нельзя взять какой-то символ и заменить его, как только строка создана — она такая навсегда. Можно лишь создать целиком новую строку и присвоить в переменную вместо старой.

Задание

Дополни код присвоив объявленным переменным выражения обращения к соответствующим элементам или свойствам строки в переменной course.

courseTopicLength - длина строки.
firstElement - первый символ строки.
lastElement - последний символ строки.

Тесты

Объявлена переменная courseTopic.
Значение переменной courseTopic это строка 'JavaSript для начинающих'.
Объявлена переменная courseTopicLength.
Значение переменной courseTopicLength это число 24.
Объявлена переменная firstElement.
Значение переменной firstElement это строка 'J'.
Объявлена переменная lastElement.
Значение переменной lastElement это строка 'х'.


const courseTopic = 'JavaSript для начинающих';
// Пиши код ниже этой строки

const courseTopicLength = courseTopic.length;
const firstElement = courseTopic[0];
const lastElement = courseTopic[courseTopicLength-1];

// Пиши код выше этой строки

Задача 32

Метод slice()

Метод строк slice(startIndex, endIndex) используется для создания копии части или всей строки. Он делает копию элементов строки от startIndex и до, но не включая endIndex и возвращает новую строку.

const productName = 'Ремонтный дроид';
console.log(productName.slice(0, 4)); // 'Ремо'
console.log(productName.slice(3, 9)); // 'онтный'
console.log(productName.slice(0, productName.length)); // 'Ремонтный дроид'
console.log(productName.slice(10, productName.length)); // 'дроид'
Задание
Функция getSubstring(string, length) принимает строку и возвращает подстроку от начала и до length символов. Она объявляет два параметра, значения которых будут задаваться во время её вызова:

string - оригинальная строка
length - количество символов с начала строки для подстроки
Присвой переменной substring выражение создания подстроки длинной length символов (от начала) из строки string.

Тесты

Объявлена функция getSubstring(string, length).
Вызов функции getSubstring('Привет мир', 3) возвращает 'При'.
Вызов функции getSubstring('Привет мир', 6) возвращает 'Привет'.
Вызов функции getSubstring('Привет мир', 8) возвращает 'Привет м'.
Вызов функции getSubstring('Привет мир', 10) возвращает 'Привет мир'.
Вызов функции getSubstring('Привет мир', 0) возвращает ''.


function getSubstring(string, length) {
  const substring = string.slice(0, length); // Дополни эту строку

  return substring;
}

Задача 33

Форматирование сообщения

Задание

Функция formatMessage(message, maxLength) принимает строку (параметр message) и форматирует её, если длина превышает значение в параметре maxLength.

Дополни код функции так, что если длина строки:

не превышает maxLength, функция возвращает её в исходном виде.
больше maxLength, то функция обрезает строку до maxLength символов и добавляет в конец троеточие '...', после чего возвращает укороченную версию.

Тесты

Объявлена функция formatMessage(message, maxLength).
Вызов функции formatMessage('Curabitur ligula sapien', 16) возвращает 'Curabitur ligula...'.
Вызов функции formatMessage('Curabitur ligula sapien', 23) возвращает 'Curabitur ligula sapien'.
Вызов функции formatMessage('Vestibulum facilisis purus nec', 20) возвращает 'Vestibulum facilisis...'.
Вызов функции formatMessage('Vestibulum facilisis purus nec', 30) возвращает 'Vestibulum facilisis purus nec'.
Вызов функции formatMessage('Nunc sed turpis a felis in nunc fringilla', 15) возвращает 'Nunc sed turpis...'.
Вызов функции formatMessage('Nunc sed turpis a felis in nunc fringilla', 41) возвращает 'Nunc sed turpis a felis in nunc fringilla'.


function formatMessage(message, maxLength) {
  let result;
// Пиши код ниже этой строки
  
 
 if (message.length > maxLength) {
    result = message.slice(0, maxLength) + '...';
 } else {
    result = message;
 }

// Пиши код выше этой строки
  return result;
}

Задача 34

Методы toLowerCase() и toUpperCase()

Бывают ситуации когда все символы в строке необходимо преобразовать в один регистр, верхний или нижний. Например, при поиске по ключевому слову, когда пользователь вводит строку 'saMsUng', а сравнить её надо со строкой 'samsung' или 'SAMSUNG'.

console.log('saMsUng' === 'samsung'); // false
console.log('saMsUng' === 'SAMSUNG'); // false
Чтобы не требовать абсолютно точный ввод можно сделать «нормализацию» введённой пользователем строки, то есть преобразовать все её символы в верхний или нижний регистр. Методы строки toLowerCase() и toUpperCase() вернут новую строку в соответствующем регистре, не изменяя оригинальную.

const BRAND_NAME = 'SAMSUNG';
const userInput = 'saMsUng';
const normalizedToUpperCaseInput = userInput.toUpperCase();

console.log(userInput); // 'saMsUng'
console.log(userInput === BRAND_NAME); // false
console.log(normalizedToUpperCaseInput); // 'SAMSUNG'
console.log(normalizedToUpperCaseInput === BRAND_NAME); // true

Задание

Функция normalizeInput(input) принимает строку (параметр input) и возвращает такую же строку, но в нижнем регистре. Присвой переменной normalizedInput выражение создания строки в нижнем регистре из параметра input.

Тесты

Объявлена функция normalizeInput(input).
Вызов функции normalizeInput('Привет мир') возвращает 'привет мир'.
Вызов функции normalizeInput('Это НЕ СпаМ') возвращает 'это не спам'.
Вызов функции normalizeInput('Большие СКИДКИ') возвращает 'большие скидки'.

function normalizeInput(input) {
  const normalizedInput = input.toLowerCase() ; // Дополни эту строку
  return normalizedInput;
}


Задача 35

Метод includes()

Метод строк includes(substring) проверяет входит ли подстрока substring в строку, возвращает буль - true если входит и false в противном случае. Регистр символов в строке и подстроке имеет значение, так как например буква 'a' не равна букве 'А'.

const productName = 'Ремонтный дроид';

console.log(productName.includes('н')); // true
console.log(productName.includes('Н')); // false
console.log(productName.includes('дроид')); // true
console.log(productName.includes('Дроид')); // false
console.log(productName.includes('Ремонтный')); // true
console.log(productName.includes('ремонтный')); // false

Задание

Функция checkName(fullname, name) принимает два параметра и возвращает буль true или false - результат проверки вхождения подстроки name в строку fullname.

fullname - полное имя состоящее из двух слов (имени и фамилии) разделённых пробелом.
name - имя для проверки вхождения в полное имя.
Присвой переменной result выражение проверки вхождения имени (параметр name), в полное имя (параметр fullname). Пусть функция строго относится к регистру букв, то есть «Петя» и «петя» для неё разные имена.

Тесты

Объявлена функция checkForName(fullname, name).
Вызов функции checkForName('Егор Колбасов', 'Егор') возвращает true.
Вызов функции checkForName('Егор Колбасов', 'егор') возвращает false.
Вызов функции checkForName('Егор Колбасов', 'егОр') возвращает false.
Вызов функции checkForName('Егор Колбасов', 'Женя') возвращает false.
Вызов функции checkForName('Вадим Некрасов', 'Вадим') возвращает true.
Вызов функции checkForName('Вадим Некрасов', 'вадим') возвращает false.
Вызов функции checkForName('Вадим Некрасов', 'Дима') возвращает false.


function checkForName(fullName, name) {
 const result = fullName.includes(name); // Дополни эту строку
  return result;
}


Задача 36

Проверка спама

Задание

Функция checkForSpam(message) принимает строку (параметр message), проверяет её на содержание запрещённых слов spam и sale, и возвращает результат проверки. Слова в строке параметра message могут быть в произвольном регистре, например SPAM или sAlE.

Если нашли запрещённое слово (spam или sale) то функция возвращает буль true.
Если в строке нет запрещённых слов, функция возвращает буль false.
Тесты
Объявлена функция checkForSpam(message).
Вызов функции checkForSpam('Latest technology news') возвращает false.
Вызов функции checkForSpam('JavaScript weekly newsletter')возвращает false.
Вызов функции checkForSpam('Get best sale offers now!') возвращает true.
Вызов функции checkForSpam('Amazing SalE, only tonight!') возвращает true.
Вызов функции checkForSpam('Trust me, this is not a spam message') возвращает true.
Вызов функции checkForSpam('Get rid of sPaM emails. Our book in on sale!') возвращает true.
Вызов функции checkForSpam('[SPAM] How to earn fast money?') возвращает true.


function checkForSpam(message) {
  let result;
  // Пиши код ниже этой строки
  
  const messageLowerCase = message.toLowerCase();
  
  if (messageLowerCase.includes('spam') || messageLowerCase.includes('sale')) {
    result = true;
  } else {
    result = false;
  }
 
  // Пиши код выше этой строки
  return result;
}


OR

function checkForSpam(message) {

  // Пиши код ниже этой строки
  
  const messageLowerCase = message.toLowerCase();
  
  return messageLowerCase.includes('spam') || messageLowerCase.includes('sale')
 
 
}

